In [18]:
import pandas as pd
import numpy as np
#show first 10 rows
data = pd.read_csv('ds_salaries.csv')
result = data.head(10)
print(result)

   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT
5           5       2020               EN              FT
6           6       2020               SE              FT
7           7       2020               MI              FT
8           8       2020               MI              FT
9           9       2020               SE              FT

                    job_title    salary salary_currency  salary_in_usd  \
0              Data Scientist     70000             EUR          79833
1  Machine Learning Scientist    260000             USD         260000
2           Big Data Engineer     85000             GBP         109024
3        Product Data Analyst     20000             USD          20000
4   Machine Learning Engineer    150000             USD         150000
5                Data Analyst     72000             USD          72000
6         Lead Data Scientist    190000             USD         190000
7              Data Scientist  11000000             HUF          35735
8       Business Data Analyst    135000             USD         135000
9          Lead Data Engineer    125000             USD         125000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L
5                 US           100               US            L
6                 US           100               US            S
7                 HU            50               HU            L
8                 US           100               US            L
9                 NZ            50               NZ            S

In [2]:
#show last 10 rows
result = data.head(-10)
print(result)

     Unnamed: 0  work_year experience_level employment_type  \
0             0       2020               MI              FT
1             1       2020               SE              FT
2             2       2020               SE              FT
3             3       2020               MI              FT
4             4       2020               SE              FT
..          ...        ...              ...             ...
592         592       2022               SE              FT
593         593       2022               SE              FT
594         594       2022               SE              FT
595         595       2022               SE              FT
596         596       2022               SE              FT

                      job_title  salary salary_currency  salary_in_usd  \
0                Data Scientist   70000             EUR          79833
1    Machine Learning Scientist  260000             USD         260000
2             Big Data Engineer   85000             GBP         109024
3          Product Data Analyst   20000             USD          20000
4     Machine Learning Engineer  150000             USD         150000
..                          ...     ...             ...            ...
592              Data Scientist  230000             USD         230000
593              Data Scientist  150000             USD         150000
594      Data Analytics Manager  150260             USD         150260
595      Data Analytics Manager  109280             USD         109280
596              Data Scientist  210000             USD         210000

    employee_residence  remote_ratio company_location company_size
0                   DE             0               DE            L
1                   JP             0               JP            S
2                   GB            50               GB            M
3                   HN             0               HN            S
4                   US            50               US            L
..                 ...           ...              ...          ...
592                 US           100               US            M
593                 US           100               US            M
594                 US           100               US            M
595                 US           100               US            M
596                 US           100               US            M

[597 rows x 12 columns]

In [3]:
row_count = len(data) # Return number of rows
print(row_count)
col_count = len(data.columns)#Return number of Coulmns
print(col_count)

607
12

In [4]:
#print coulmns names
for col_name in data.columns: 
    print(col_name)

Unnamed: 0
work_year
experience_level
employment_type
job_title
salary
salary_currency
salary_in_usd
employee_residence
remote_ratio
company_location
company_size

In [8]:
#last coulmn name
data.columns[-1]

'company_size'

In [10]:
#4th coulmn type
data.dtypes[4]

dtype('O')

In [21]:
#  how many different types in this column
currency=data['salary_currency'].nunique()
print(currency)

17

In [23]:
#Mean of every Coulmn 
MEAN= data.mean()
MEAN

C:\Users\alaar\AppData\Local\Temp\ipykernel_5248\2206931133.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  MEAN= data.mean()

Unnamed: 0          303.000000
work_year          2021.405272
salary           324000.062603
salary_in_usd    112297.869852
remote_ratio         70.922570
dtype: float64

In [24]:
#precentail in 75%
Percentile=data.quantile(q=0.75, axis=0,numeric_only=True,interpolation='linear')
Percentile

Unnamed: 0          454.5
work_year          2022.0
salary           165000.0
salary_in_usd    150000.0
remote_ratio        100.0
Name: 0.75, dtype: float64

In [25]:
#mode is the most reapeted coulmn salary currency coulmn
ff= data['salary_currency'].mode()
ff

0    USD
Name: salary_currency, dtype: object

In [26]:
#standard Divatiation
standard_deviation= data.std()
standard_deviation

C:\Users\alaar\AppData\Local\Temp\ipykernel_5248\3258055237.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  standard_deviation= data.std()

Unnamed: 0       1.753701e+02
work_year        6.921330e-01
salary           1.544357e+06
salary_in_usd    7.095726e+04
remote_ratio     4.070913e+01
dtype: float64

In [27]:
#precentail in 50%
Percentile=data.quantile(q=0.5, axis=0,numeric_only=True,interpolation='linear')
Percentile

Unnamed: 0          303.0
work_year          2022.0
salary           115000.0
salary_in_usd    101570.0
remote_ratio        100.0
Name: 0.5, dtype: float64

In [28]:
#precentail in 25%
Percentile=data.quantile(q=0.25, axis=0,numeric_only=True,interpolation='linear')
Percentile

Unnamed: 0         151.5
work_year         2021.0
salary           70000.0
salary_in_usd    62726.0
remote_ratio        50.0
Name: 0.25, dtype: float64

In [30]:
#more than 20000 in salary 
more=data.loc[(data['salary'] >= 20000)]
more

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [33]:
#Jobs start with M
data['job_title'].str.startswith('M')

0      False
1       True
2      False
3      False
4       True
       ...
602    False
603    False
604    False
605    False
606    False
Name: job_title, Length: 607, dtype: bool

In [39]:
#Discretize any numerical column into 6 groups using equal interval method and count the values in
#each bin/Group. Make sure intervals are sorted when counting them).
gh=pd.cut(data['remote_ratio'],bins=6).value_counts()
gh

(83.333, 100.0]     381
(-0.1, 16.667]      127
(33.333, 50.0]       99
(16.667, 33.333]      0
(50.0, 66.667]        0
(66.667, 83.333]      0
Name: remote_ratio, dtype: int64

In [40]:
# the total number of duplicated rows and drop them if there are any
i=data.duplicated().sum()
i

0